# CREAR UN DATAFRAME

## 1 Primera opción para crear un dataframe

In [2]:
import pandas as pd
import numpy as np

In [3]:
data_1 = np.array([[7,6], [1,4], [5,9]])

In [5]:
df = pd.DataFrame(data_1, 
                  index=['row1','row2','row3'], 
                  columns=['col1','col2'])

In [6]:
df

      col1  col2
row1     7     6
row2     1     4
row3     5     9

## 2 Segunda opción para crear un dataframe

In [8]:
data_2 = [[7,6], [1,4], [5,9]]

In [9]:
df_2 = pd.DataFrame(data_2, 
                    index=['row1','row2','row3'], 
                    columns=['col1','col2'])

In [10]:
df_2

      col1  col2
row1     7     6
row2     1     4
row3     5     9